package main

func getBotCreators() []string {
	return []string{"rf0x1d"}
}

func getBotToken() string {
	return "123123:AAABBBCCCDDDEEEFFF"
}

func getCreatorID() int64 {
	return 123123
}

func getNatribuOwnMessage() []string {
	return []string{
		"Добро пожаловать <b>НАХУЙ!</b>",
		"Вы попали на страницу <u>символического направления</u>!",
		" ",
		"<b>Ой, что это?!</b>",
		" Здесь расположено неофициальное представительство НАХУЙ в телеграме. Сюда посылают.",
		" ",
		"<b>Что же это значит?!</b>",
		" Если вы оказались здесь, это означает только одно: вас послали нахуй. Грубо, но элегантно: прислав эту ссылку.",
	}
}

func getNatribuSecondMessage() []string {
	return []string{
		"<b>Как же такое могло случиться со мной?!</b>",
		" Вот самые распространенные причины: ",
		"  • Вы утомили собеседника глупыми вопросами, просьбами или советами.",
		"  • Вы обидели собеседника неосторожным высказыванием: задели его религиозные, политические, музыкальные и прочие взгляды и вкусы, либо иным образом вторглись в его внутренний мир и подвергли критике то, чем он дорожит.",
		"  • Вам намекают о том, что не вернут долг, не заплатят за работу, отказывают в сексуальной близости.",
		"  • С вами просто не хотят общаться. Такое тоже бывает.",
		" ",
		"Есть конечно вариант, что вы попали на эту страницу случайно, увидя ее, например, в чате.",
		"Задумайтесь: быть может, вам надо серьезно пересмотреть свои взгляды на жизнь, если даже телеграм стал по своей инициативе предлагать вам пойти нахуй?",
	}
}

func getNatribuThirdMessage() []string {
	return []string{
		"<b>Что же мне теперь делать?!</b>",
		" Советуем: ",
		"  • Пересмотреть свое отношение к этому человеку.",
		"  • Всерьез на него обидеться.",
		"  • Поставить закладку, и в следующий раз послать ссылку тому, кого хотите послать нахуй вы.",
		" ",
		"Если ваш собеседник плохо понимает написанное - пришлите ему ссылку маркдауном, рисунок или логотип, выбрав подходящий шедевр в не нашей <a href=\"https://natribu.org/media/\">медиатеке</a>",
	}
}

func getSourceMessage() string {
	return "Репозиторий проекта:"
}

func getSourceRepo() string {
	return "github.com/rfoxxxyshit/natribot"
}
